doc/blog/using-covid-19-pubseq-part1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-26 Mon 05:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>COVID-19 PubSeq - query metadata (part 1)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pjotr Prins" />
<link rel="Blog stylesheet" type="text/css" href="blog.css" />
</head>
<body>
<div id="content">
<h1 class="title">COVID-19 PubSeq - query metadata (part 1)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d34f90">1. What does this mean?</a></li>
<li><a href="#orgc40ff7e">2. Fetch sequence data</a></li>
<li><a href="#orgc6519bc">3. Predicates</a></li>
<li><a href="#orgbb4bffc">4. Fetch submitter info and other metadata</a></li>
<li><a href="#orgae8b515">5. Fetch all sequences from Washington state</a></li>
<li><a href="#org74c9c22">6. Discussion</a></li>
<li><a href="#org26808ce">7. Acknowledgements</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8d34f90" class="outline-2">
<h2 id="org8d34f90"><span class="section-number-2">1</span> What does this mean?</h2>
<div class="outline-text-2" id="text-1">
<p>
This means that when someone uploads a SARS-CoV-2 sequence using one
of our tools (CLI or web-based) they add some metadata which is
expressed in a <a href="https://github.com/arvados/bh20-seq-resource/blob/master/bh20sequploader/bh20seq-schema.yml">schema</a> that looks like
</p>

<div class="org-src-container">
<pre class="src src-json">- name: hostSchema
  type: record
  fields:
    host_species:
        doc: Host species as defined in NCBITaxon, e.g. http://purl.obolibrary.org/obo/NCBITaxon_<span style="color: #8bc34a;">9606</span> for Homo sapiens
        type: string
        jsonldPredicate:
          _id: http://www.ebi.ac.uk/efo/EFO_<span style="color: #8bc34a;">0000532</span>
          _type: <span style="color: #9ccc65;">"@id"</span>
          noLinkCheck: <span style="color: #8bc34a;">true</span>
    host_sex:
        doc: Sex of the host as defined in PATO, expect male () or female ()
        type: string?
        jsonldPredicate:
          _id: http://purl.obolibrary.org/obo/PATO_<span style="color: #8bc34a;">0000047</span>
          _type: <span style="color: #9ccc65;">"@id"</span>
          noLinkCheck: <span style="color: #8bc34a;">true</span>
    host_age:
        doc: Age of the host as number (e.g. <span style="color: #8bc34a;">50</span>)
        type: int?
        jsonldPredicate:
          _id: http://purl.obolibrary.org/obo/PATO_<span style="color: #8bc34a;">0000011</span>
</pre>
</div>

<p>
this metadata gets transformed into an RDF database which means
information can easily be fetched related to uploaded sequences.
We'll show an example below where we query a live database.
</p>

<p>
There is more: when a new sequence gets uploaded COVID-19 PubSeq kicks
in with a number of workflows running in the cloud. These workflows
generate a fresh variation graph (GFA) containing all sequences, an
RDF file containing metadata, and an RDF file containing the variation
graph in triples. Soon we will at multi sequence alignments (MSA) and
more. Anyone can contribute data, tools and workflows to this
initiative!
</p>
</div>
</div>

<div id="outline-container-orgc40ff7e" class="outline-2">
<h2 id="orgc40ff7e"><span class="section-number-2">2</span> Fetch sequence data</h2>
<div class="outline-text-2" id="text-2">
<p>
The latest run of the pipeline can be viewed <a href="http://covid19.genenetwork.org/status">here</a>. Each of these
generated files can just be downloaded for your own use and sharing!
Data is published under a <a href="https://creativecommons.org/licenses/by/4.0/">Creative Commons 4.0 attribution license</a>
(CC-BY-4.0). This means that, unlike some other 'public' resources,
you can use this data in any way you want, provided the submitter gets
attributed.
</p>

<p>
If you download the GFA or FASTA sequences you'll find sequences are
named something like
<b>keep:e17abc8a0269875ed4cfbff5d9897c6c+123/sequence.fasta</b> which
refers to an internal Arvados Keep representation of the FASTA
sequence.  Keep is content-addressable which means that the value
e17abc8a0269875ed4cfbff5d9897c6c uniquely identifies the file by its
contents. If the contents change, the identifier changes! We use
these identifiers throughout.
</p>
</div>
</div>
